/******************************************************************************
 * 文件名: Servo.cpp
 * 描述: 舵机驱动
 *****************************************************************************/
#include "Servo.h"


//舵机控制参数往下为降低，往上为上高

// 定义舵机控制引脚
const int servo1Pin = 5;
const int servo2Pin = 3;

/*********************************************************************
 * 函数名称：Servo_Init
 * 函数功能：舵机初始化
 ********************************************************************/
void Servo_Init() {
  pinMode(servo1Pin,OUTPUT);
  pinMode(servo2Pin,OUTPUT);
  analogWrite(servo1Pin,250);	 //250最大 50最小
  analogWrite(servo2Pin,200);	//200最大 50最小
}

/*********************************************************************
 * 函数名称：Servo1
 * 函数功能：舵机 1 转动
 * 形    参：转动角度
 * 输    出：无
 * 备    注：无

 ********************************************************************/
void Servo1(int angle) {
    analogWrite(servo1Pin,angle);	
}

/*********************************************************************
 * 函数名称：Servo2
 * 函数功能：舵机 2 转动
 * 形    参：转动角度
 * 输    出：无
 * 备    注：无

 ********************************************************************/
void Servo2(int angle) {
    analogWrite(servo2Pin,angle);	
}